1.¿Qué diferencia hay entre una Serie y un DataFrame? La, serie es de de una sola dimensión y el Dataframe son dos dimensiones, aunque sea de una serie cuyos índices se integran como columna.

2.Momento de trabajar con Series. Contestad a las siguientes preguntas:

Crea dos listas:

Una que se llame "valores" que tenga 7 números aleatorios.

Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [51]:
import numpy as np
import pandas as pd
import random

In [52]:
valores = random.sample(range(10),7)
valores

[6, 4, 0, 9, 7, 3, 2]

In [53]:
indices = ['lunes','martes','miércoles','jueves','viernes','sabado','domingo']
indices

['lunes', 'martes', 'miércoles', 'jueves', 'viernes', 'sabado', 'domingo']

A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [54]:
serie1 = pd.Series(valores, index = indices)
serie1

lunes        6
martes       4
miércoles    0
jueves       9
viernes      7
sabado       3
domingo      2
dtype: int64

A partir de las dos listas anteriores cread un diccionario usando un bucle for.
 Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez.
  Más informción sobre este método aquí.

In [55]:
lista_zip = list(zip(indices,valores)) # hemos creado una lista del zip de los indices con los valores
diccio1 = {} # creamos diccionario vacío
for x, y in lista_zip: #iteramos por la lista para unir keys con values
    diccio1[x] = y
print(diccio1)

{'lunes': 6, 'martes': 4, 'miércoles': 0, 'jueves': 9, 'viernes': 7, 'sabado': 3, 'domingo': 2}

Crea una Serie con el diccionario creado en el punto anterior.

In [56]:
serie_diccionario = pd.Series(diccio1)
serie_diccionario

lunes        6
martes       4
miércoles    0
jueves       9
viernes      7
sabado       3
domingo      2
dtype: int64

Qué forma tiene esta última Serie?

¿Qué tipo de datos tiene?

¿Qué tamaño tiene?

¿Cuáles son los índices de la Serie?

¿Y los values?

Extraed el valor para el índice "lunes"

Extraed el valor para el índice "lunes", "martes" y "miércoles".

Extraed el valor para el índice "lunes" y "domingo".

In [73]:
print('La forma es', serie_diccionario.shape)
print('El tipo de dato es', serie_diccionario.dtype) 
print('El tamaño es', serie_diccionario.size)  
print('Los índices son', serie_diccionario.index)
print('Los valores son', serie_diccionario.values) 
print('El valor de lunes es', serie_diccionario['lunes'])
print('El valor de lunes, martes y miércoles es',serie_diccionario[0:3]) 
print('El valor de lunes y domingo es', serie_diccionario[0],serie_diccionario[-1])

La forma es (7,)
El tipo de dato es int64
El tamaño es 7
Los índices son Index(['lunes', 'martes', 'miércoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')
Los valores son [6 4 0 9 7 3 2]
El valor de lunes es 6
El valor de lunes, martes y miércoles es lunes        6
martes       4
miércoles    0
dtype: int64
El valor de lunes y domingo es 6 2

3. Es el turno de los DataFrames

Cread un array de dos dimensiones con 4 filas y 3 columnas.

Convertid el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

Descargad el archivo "medallas" y cargad el DataFrame con la siguiente línea de código:

In [58]:
array1 = np.random.randint(0,10,(4,3))  # crear array
array1

array([[0, 9, 9],
       [2, 0, 4],
       [2, 9, 9],
       [1, 7, 2]])

In [59]:
df1 = pd.DataFrame(array1, columns =["España", "Francia" ,"Italia"])
df1

   España  Francia  Italia
0       0        9       9
1       2        0       4
2       2        9       9
3       1        7       2

In [60]:
df = pd.read_csv("medallas.csv", index_col=["País"])
df

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

Usando el loc extraed todas las columnas de la fila Tailandia.

Usando el loc extraed todas las columnas de China e Irán.

Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

Usando el iloc extraed la información de la India. Devolved todas las columnas.

Usando el iloc extraed todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

Utilizando el código del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".

In [61]:
df.loc['Tailandia',:]

Unnamed: 0      7
Oro           132
Plata         175
Bronce        278
Name: Tailandia, dtype: int64

In [62]:
df.loc[['China','Irán'],:]

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

In [63]:
df.loc[['China','Irán'],['Oro','Plata','Bronce']]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

In [64]:
df.iloc[5,:]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

In [65]:
df.iloc[1::2,:]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Irán                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

In [66]:
df.iloc[1::2,1:]

                  Oro  Plata  Bronce
País
Japón            1032   1037     985
Irán              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

Contestad a las siguientes preguntas:

¿Qué país consiguió más de 200 medallas de oro?

¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [67]:
df.loc[df.Oro>200]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [68]:
df.loc[(df.Oro>200)&(df.Plata>1000)]

       Unnamed: 0   Oro  Plata  Bronce
País
Japón           2  1032   1037     985

In [69]:
df.loc[(df.Oro>200)|(df.Bronce>700)]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. 
Eliminad esa columna.

Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

In [70]:
df = df.drop(['Unnamed: 0'],axis =1) # borra columna Unnmamed: 0 del eje 1 
df

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

In [71]:
df['Total'] = (df['Oro']+df['Plata']+df['Bronce'])
df

                  Oro  Plata  Bronce  Total
País
China            1473    994     720   3187
Japón            1032   1037     985   3054
Corea del Sur     745    663     827   2235
Irán              179    181     197    557
Kazajistán        155    158     224    537
India             154    202     315    671
Tailandia         132    175     278    585
Indonesia         112    131     240    483
China Taipéi       99    144     276    519
Corea del Norte    91    120     235    446